import React from "react";

class Content extends React.Component {
  constructor(props) {
    super(props);
    this.state = { isBlue5: true };
  }

  updateColors = () => {
    this.setState((prevState) => ({ isBlue5: !prevState.isBlue5 }));
  };

  render() {
    const { isBlue5 } = this.state;
    return (
      <main>
        <h2 id="element4">Хобі</h2>
        <ul>
          <li
            id="element5"
            style={{
              backgroundColor: isBlue5 ? "blue" : "green",
              color: isBlue5 ? "white" : "black",
            }}
            onClick={this.updateColors}
          >
            Лего
          </li>
          <li
            id="element6"
            style={{
              backgroundColor: isBlue5 ? "green" : "blue",
              color: isBlue5 ? "black" : "white",
            }}
            onClick={this.updateColors}
          >
            Велосипед
          </li>
          <li id="element7">Фотографування будівель</li>
          <li id="element8">Програмування</li>
        </ul>

        <h2 id="element9">Улюблені книги</h2>
        <ol>
          <li id="element10">Гаррі Поттер</li>
          <li id="element11">Персі Джексон</li>
          <li id="element12">Дюна</li>
        </ol>

        <h3 id="element13">Чернівці</h3>

        <p id="element14">
          Чернівці — місто на заході України, адміністративний центр
          Чернівецької області, яке є одним із культурних центрів країни. Воно
          славиться своєю архітектурою, зокрема, Чернівецьким університетом,
          який є об'єктом світової спадщини ЮНЕСКО. Місто має багатокультурну
          спадщину, оскільки в різні часи входило до складу Австро-Угорщини,
          Румунії та СРСР, що залишило відбиток на його культурі, традиціях і
          мові.
        </p>

        <p id="element15">
          Чернівці часто називають «українським Віднем» або «маленьким Парижем»
          за його унікальний архітектурний стиль. Серед головних архітектурних
          пам'яток міста — Резиденція митрополитів Буковини і Далмації,
          Центральна площа з ратушею, Площа Філармонії та драматичний театр ім.
          Ольги Кобилянської. Вулиці Чернівців також вражають своєю атмосферою:
          вузькі вулички, бруківка та старовинні будівлі переносять у минулі
          століття.
        </p>

        <p id="element16">
          Місто має насичене культурне життя, з численними театрами, музеями,
          концертними залами, а також численними фестивалями і святковими
          подіями, що відбуваються впродовж року. Чернівці є одним із важливих
          центрів літератури та мистецтва в Україні.
        </p>
      </main>
    );
  }
}

export default Content;